2024-01-18-YasforGreekLetters/notes.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://dou-meishi.github.io/org-blog/rss.xml"
      title="RSS feed for https://dou-meishi.github.io/org-blog/">
<title>Use YASnippet to Input Greek Characters</title>
<meta name="author" content="Dou Meishi">
<meta name="referrer" content="no-referrer">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link href= "https://gongzhitaao.org/orgcss/org.css" rel="stylesheet" type="text/css" />
<link href= "https://dou-meishi.github.io/org-blog/static/dou-org-blog.css" rel="stylesheet" type="text/css" />
<!-- Math Support by KaTeX -->
<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/katex@0.16.9/dist/katex.min.css" integrity="sha384-n8MVd4RsNIU0tAv4ct0nTaAbDJwPJzDEaqSD1odI+WdtXRGWt2kTvGFasHpSy3SV" crossorigin="anonymous">
<!-- The loading of KaTeX is deferred to speed up page rendering -->
<!-- To automatically render math in text elements, include the auto-render extension: -->
</head>
<body>
<div id="preamble" class="status"><div class="header">
  <div class="sitelinks">
    <a href="https://dou-meishi.github.io/org-blog/index.html">Home</a>
    |
    <a href="https://dou-meishi.github.io/org-blog/archive.html">All Posts</a>
  </div>
</div>
</div>
<div id="content">
<div class="post-date">18 Jan 2024</div><h1 class="post-title"><a href="https://dou-meishi.github.io/org-blog/2024-01-18-YasforGreekLetters/notes.html">Use YASnippet to Input Greek Characters</a></h1>
<p>
Sometimes, single characters like <code>α</code> and <code>β</code> are more recognizable than words like <code>alpha</code> and <code>beta</code>.
I think it is particularly useful when writing formulae in LaTeX or other text environments.
There are many general ways to input unicode characters quickly. For instance,
most intelligent input methods will suggest α as a candidate when you input alpha. In addition,
Emacs includes a built-in function <code>insert-char</code>, which is bound to <code>C-x 8 RET</code> by default.
<a href="https://github.com/joaotavora/yasnippet">YASnippet</a> is another way I think is more convenient for frequently used symbols.
</p>

<p>
For example, put the following content in the file <code>~/.emacs.d/snippets/text-mode/char-alpha</code>.
</p>

<div class="org-src-container">
<pre class="src src-text"># -*- mode: snippet -*-
# name: char-alpha
# key: \alpha
# --
&#945;
</pre>
</div>

<p>
Then, when you type <code>\alpha&lt;TAB&gt;</code>, the string expands to <code>α</code>. Of course,
this only works in text mode and its derived mode. But you can easily
enable this feature in any mode, say <code>prog-mode</code>, by adding a line
</p>

<div class="org-src-container">
<pre class="src src-text">text-mode
</pre>
</div>

<p>
to the file <code>~/.emacs.d/snippets/prog-mode/.yas-parents</code>.  Remember to
remove the last newline character in the file <code>char-alpha</code>.  Otherwise,
it will expand to <code>\alpha&lt;NewLine&gt;</code>.
</p>

<p>
I create <a href="https://gist.github.com/Dou-Meishi/6db3e58138714198da7095a8f4ac82cd">a csv file</a> whose rows are greek letters and their name in latex, which looks like
</p>

<div class="org-src-container">
<pre class="src src-csv">α, alpha
β, beta
γ, gamma
δ, delta
ϵ, epsilon
ε, varepsilon
...
</pre>
</div>

<p>
Based on this list, the following simple Python script can produce all the required snippets for greek letters.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #268bd2;">filename</span> = <span style="color: #2aa198;">'greek.csv'</span>
<span style="color: #859900; font-weight: bold;">with</span> <span style="color: #657b83; font-weight: bold;">open</span>(filename, <span style="color: #2aa198;">'r'</span>) <span style="color: #859900; font-weight: bold;">as</span> fpr:
    <span style="color: #268bd2;">greeklines</span> = fpr.readlines()

<span style="color: #268bd2;">snippetTemplate</span> = r<span style="color: #2aa198;">"""# -*- mode: snippet -*-</span>
<span style="color: #2aa198;"># name: char-{name}</span>
<span style="color: #2aa198;"># key: \{name}</span>
<span style="color: #2aa198;"># --</span>
<span style="color: #2aa198;">{char}"""</span>

<span style="color: #268bd2;">charNameTuples</span> = [line.strip().split(<span style="color: #2aa198;">", "</span>) <span style="color: #859900; font-weight: bold;">for</span> line <span style="color: #859900; font-weight: bold;">in</span> greeklines]
<span style="color: #859900; font-weight: bold;">for</span> char, name <span style="color: #859900; font-weight: bold;">in</span> charNameTuples:
    <span style="color: #859900; font-weight: bold;">with</span> <span style="color: #657b83; font-weight: bold;">open</span>(f<span style="color: #2aa198;">"char-</span>{name}<span style="color: #2aa198;">"</span>, <span style="color: #2aa198;">"w"</span>, encoding=<span style="color: #2aa198;">"utf8"</span>) <span style="color: #859900; font-weight: bold;">as</span> fpr:
        fpr.write(snippetTemplate.<span style="color: #657b83; font-weight: bold;">format</span>(name=name, char=char))
</pre>
</div>

<p>
Of couse, this method can be used to input any unicode letters, not
limited to greek letters.
</p>
<div class="taglist"><a href="https://dou-meishi.github.io/org-blog/tags.html">Tags</a>: <a href="https://dou-meishi.github.io/org-blog/tag-emacs.html">emacs</a> </div>
<div id="comments"><script src="https://giscus.app/client.js"
        data-repo="Dou-Meishi/org-blog"
        data-repo-id="R_kgDOLJfSOw"
        data-category="Announcements"
        data-category-id="DIC_kwDOLJfSO84CkxDd"
        data-mapping="pathname"
        data-strict="0"
        data-reactions-enabled="1"
        data-emit-metadata="0"
        data-input-position="bottom"
        data-theme="light"
        data-lang="en"
        crossorigin="anonymous"
        async>
</script>
</div></div>
<div id="postamble" class="status">Created by <a href="https://github.com/bastibe/org-static-blog/">Org Static Blog</a>
</div>
</body>
</html>
